// This file holds information about each garden.
const Map<int, Map<String, String>> gardens = {
  1: {
    'name': 'สวนสมุนไพร Medicinal Plant Garden',
    'details': 'สวนสมุนไพรมหาวิทยาลัยแม่ฟ้าหลวงฯ จัดตั้งบนพื้นที่ประมาณ17ไร่โดยมีเป้าหมายเพื่อเป็นแหล่งรวบรวมและจัดแสดงพืชสมุนไพรที่นำมาใช้เป็นยารักษาโรค .',
  },
  2: {
    'name': 'สวนวิวัฒนาการ Evolution Garden',
    'details': 'สวนวิวัฒนาการ เป็นแหล่งเรียนรู้นอกห้องเรียน ที่เหมาะสำหรับนักเรียน นักศึกษา และผู้ที่สนใจ ให้สามารถเข้ามาศึกษาเรียนรู้ในหัวข้อของอาณาจักรพืช .',
  },
  3: {
    'name': 'สวนวิวัฒนาการ  Evolution Garden',
    'details': 'สวนวิวัฒนาการ เป็นแหล่งเรียนรู้นอกห้องเรียน ที่เหมาะสำหรับนักเรียน นักศึกษา และผู้ที่สนใจ ให้สามารถเข้ามาศึกษาเรียนรู้ในหัวข้อของอาณาจักรพืช .',
  },
  4: {
    'name': 'ิอุทยานไม้ดอก Foristic Garden',
    'details': 'อุทยานไม้ดอก แหล่งรวบรวมพืชมีดอกนานาพรรณ บนพื้นที่จัดแสดงขนาดพื้นที่จำนวน 10 ไร่ นับเป็นสวนที่ถือว่ามีความรื่นรมย์ทางสุนทรีย์ภาพความงดงามของดอกไม้ไทยมากที่สุดสวนหนึ่งในสวนพฤกษศาสต์มหาวิทยาลัยแม่ฟ้าหลวง',
  },
  5: {
    'name': 'สวนพุทธพฤกษ์ Bhuddist Plant Garden',
    'details': 'สวนพุทธพฤกษ์ เป็นแหล่งเรียนรู้ทางธรรมชาติ บนพื้นที่ขนาด 4 ไร่ ที่รวบรวมพรรณไม้ในพุทธประวัติเพื่อให้ประชาชนสามารถศึกษาค้นคว้าพรรณไม้ที่มีความเกี่ยวข้องในพุทธประวัติ.',
  },
  6: {
    'name': 'สวนวัฒนธรรม Home Garden of Ethnic Groups',
    'details': 'ลานวัฒนธรรม­แหล่งรวบรวมพรรณพืชที่มีความเกี่ยวข้องกับวัฒนธรรม พิธีกรรม และวิถีความเป็นอยู่ของชาติพันธุ์ในพื้นที่จังหวัดเชียงราย.',
  },
  7: {
    'name': 'สวนพรรณไม้หายาก Rare Plant Garden',
    'details': 'ด้วยวัตถุประสงค์ของการรวบรวมและจัดแสดงพรรณไม้ของสวนพฤกษศาสตร์มหาวิทยาลัยแม่ฟ้าหลวงฯ ที่นอกจากจะให้ประชาชนทั่วไปได้ใช้ในการศึกษาค้นคว้าทางด้านพฤกษศาสตร์แล้ว .',
  },
  8: {
    'name': 'สวนสน Pine garden',
    'details': '“สน” เป็นพืชโบราณจัดอยู่ในพืชจำพวก พืชเมล็ดเปลือย (Gymnosperms) มักพบขึ้นตามที่สูง .',
  },
  9: {
    'name': 'สวนเบญจพฤกษ์ Banana Bamboo Lotus Orchid and Giger Collection',
    'details': 'จัดสร้างขึ้นเพื่อเป็นแหล่งรวบรวมพรรณพืชเขตร้อนจำนวน 5 กลุ่ม ประกอบด้วย พืชวงศ์กล้วย พืชวงศ์กล้วยไม้ พืชวงศ์บัว พืชวงศ์ไผ่ และพืชวงศ์ขิงข่า ในพื้นที่จัดแสดง 31 ไร่ .',
  },
  10: {
    'name': 'สวนวัลยชาติ Climber Garden',
    'details': 'ส้นทางวัลยชาติ ท่ามกลางพรรณไม้เลื้อยที่เลี้ยวลด “สวนวัลยชาติ” แหล่งรวบรวมพรรณไม้เลี้อยนานาพรรณ บนพื้นที่ขนาด 20 ไร่ .',
  },
  11: {
    'name': 'สวนซากุระ Mangrove  Sakura garden',
    'details': 'A อุโมงดอกซากุระสายพันธุ์ยูนนาน หนึ่งในหลากหลายสายพันธุ์ซากุระที่รวบรวมไว้ใพื้นที่ .',
  },
};
